// Задача № 1
// Создайте всплывающее окно, которое спрашивает имя у пользователя и 
// выводит его с помощью функции.
// Не просто использовуйте prompt или alert или confirm, 
// а создайте свою функцию, пример: "function Вашеимяфункциитут()"‼️

// let userName = prompt('Как вас зовут?');
// function showName() {
// let message = 'Привет, ' + userName;
// alert(message);
// }
// showName();


// Задача № 2
// Создайте всплывающее окно, которое спрашивает ввод любимого фильма и 
// если ввод неверен, то программа отправляет запрос alert 
// “Попробуйте ещё раз”. В функции должны быть минимум 2 условия.

// let userFilm = prompt('Какой у вас любимый фильм?');
// if (userFilm == "Собачье сердце") {
//     alert('Да вы знаток! Это тоже мой любимый фильм');
// }
// else {
//     alert('У нас не совпало! Попробуйте ещё раз');
// }